# The merge function

In [1]:
import pandas as pd

left_df = pd.DataFrame({
                    'firm': ['Accenture','Citi','GS'],
                    'varA': ['A1', 'A2', 'A3']})

right_df = pd.DataFrame({
                    'firm': ['GS','Chase','WF'],
                    'varB': ['B1', 'B2', 'B3'],
                    'varc': ['C1', 'C2', 'C3']})

In [2]:
left_df

        firm varA
0  Accenture   A1
1       Citi   A2
2         GS   A3

In [3]:
right_df

    firm varB varc
0     GS   B1   C1
1  Chase   B2   C2
2     WF   B3   C3

Let use shift+tab to talk about the parameters.

Put your cursor in the merge function below and hit shift tab

In [4]:
# left_df.merge(

The main parameters:
- right
- how
- on and its variants 
- indicator 
- validate

## Part 1

_Prof: Leave the "how" slide on the board_

Some work with the mechanics:

- Q0 Merge both datasets above with each possible value of `how`. How many observations result from each of the four merges?

In [5]:
left_df.merge(right_df, how='inner')

# what is the key variable? (not specified) - by default - uses ALL same named vars in both datasets
# here - firm is in both 

# inner = keys in both (GS)

  firm varA varB varc
0   GS   A3   B1   C1

## tip 0: always specify HOW 

Default is inner, but did you mean for that? Be explicit!

## tip 1: ALWAYS SPECIFY ON (or the alts)

else, it chooses for you

## tip 2: left merge is how you (typically) add new variables to a dataset  

- The next most common way is a inner merge - but this will reduce your sample.
- The next most common way is the outer merge

In [7]:
left_df.merge(right_df, how='left', on='firm') # this is like "add varb and varc from the other data to mmy analysis data"

        firm varA varB varc
0  Accenture   A1  NaN  NaN
1       Citi   A2  NaN  NaN
2         GS   A3   B1   C1

In [8]:
left_df.merge(right_df, how='right', on='firm')

    firm varA varB varc
0     GS   A3   B1   C1
1  Chase  NaN   B2   C2
2     WF  NaN   B3   C3

In [6]:
left_df.merge(right_df, how='outer', on='firm')

# NaN is put in columns for rows that aren't n the other dataset

        firm varA varB varc
0  Accenture   A1  NaN  NaN
1       Citi   A2  NaN  NaN
2         GS   A3   B1   C1
3      Chase  NaN   B2   C2
4         WF  NaN   B3   C3

In [ ]:
# we skip cross merges. ask me if you think it's right

- Q1 Compare `left_df.merge(right_df)` and `pd.merge(left_df, right_df)`. Are they the same or different? What do we learn from this?

In [10]:
left_df.merge(right_df)

  firm varA varB varc
0   GS   A3   B1   C1

In [11]:
pd.merge(left_df, right_df)

  firm varA varB varc
0   GS   A3   B1   C1

- functionally, they are the same! 
- left.merge(right) can be used in CHAINS

- Q2 Successfully do an outmer merge between `left_df` and `ChosenOne`. Then try to do an outer merge between `left_df` and `CurryForThree` (both are defined below)

In [12]:
ChosenOne = pd.DataFrame({
                    'tic': ['GS','GS','GS'],
                    'varB': ['B1', 'B2', 'B3'],
                    'varc': ['C1', 'C2', 'C3']})    

CurryForThree = pd.DataFrame({
                    'var1': ['GS','GS','GS'],
                    'varD': ['D1', 'D2', 'D3'],
                    'varE': ['E1', 'E2', 'E3']}).set_index('var1')

In [15]:
ChosenOne

  firm varB varc
0   GS   B1   C1
1   GS   B2   C2
2   GS   B3   C3

In [14]:
CurryForThree

     varD varE
var1
GS     D1   E1
GS     D2   E2
GS     D3   E3

In [18]:
# these dfs don't have firm!

left_df.merge(ChosenOne, left_on = 'firm', 
             right_on = 'tic', how='outer', 
             validate='1:m')

# not 3 rows, not given 9, not given 6 --> 5

        firm varA  tic varB varc
0  Accenture   A1  NaN  NaN  NaN
1       Citi   A2  NaN  NaN  NaN
2         GS   A3   GS   B1   C1
3         GS   A3   GS   B2   C2
4         GS   A3   GS   B3   C3

Why do we get 5 rows?

Merge type: 1:1,  1:m, m:1, m:m
- 1:1 means keys in the left are unique, keys in the right are unique
- **1:m means keys in the left are unique, keys in the right are not-unique** this merge above  
- m:1 means keys in the left are not-unique, keys in the right are unique  
- m:m means keys in the left are not-unique, keys in the right are not-unique

In [19]:
CurryForThree

     varD varE
var1
GS     D1   E1
GS     D2   E2
GS     D3   E3

In [21]:
left_df.merge(CurryForThree, left_on = 'firm', 
             right_on = 'var1', how='outer', 
             validate='1:m')

# or:

left_df.merge(CurryForThree, left_on = 'firm', 
             right_index = True, how='outer', 
             validate='1:m')

        firm varA varD varE
0  Accenture   A1  NaN  NaN
1       Citi   A2  NaN  NaN
2         GS   A3   D1   E1
2         GS   A3   D2   E2
2         GS   A3   D3   E3

- Q3 Do an outer merge with `left_df` and `right_df` and output the source of each observation by using the "indicate" option.

In [29]:
left_df.merge(right_df,how='outer', validate='1:1', indicator=True)

        firm varA varB varc      _merge
0  Accenture   A1  NaN  NaN   left_only
1       Citi   A2  NaN  NaN   left_only
2         GS   A3   B1   C1        both
3      Chase  NaN   B2   C2  right_only
4         WF  NaN   B3   C3  right_only

In [25]:
left_df.merge(right_df,how='outer', validate='1:m')

        firm varA varB varc
0  Accenture   A1  NaN  NaN
1       Citi   A2  NaN  NaN
2         GS   A3   B1   C1
3      Chase  NaN   B2   C2
4         WF  NaN   B3   C3

In [26]:
left_df.merge(right_df,how='outer', validate='m:1')

        firm varA varB varc
0  Accenture   A1  NaN  NaN
1       Citi   A2  NaN  NaN
2         GS   A3   B1   C1
3      Chase  NaN   B2   C2
4         WF  NaN   B3   C3

In [27]:
left_df.merge(right_df,how='outer', validate='m:m')

        firm varA varB varc
0  Accenture   A1  NaN  NaN
1       Citi   A2  NaN  NaN
2         GS   A3   B1   C1
3      Chase  NaN   B2   C2
4         WF  NaN   B3   C3

## tip 3: always VALIDATE your merge 
- but: try the most restrictive first
- never bother with m:m ... but if you are doing a m:m... think if you're doing what you think
- **If you are adding a new variable into a left, from the right: 1:1 or m:1 is what you want!!!**

- Q4 Repeat the outer merge we just did, but four times: try each possible value of "validate"

In [30]:
left_df.merge(right_df,how='outer', validate='1:1', indicator=True)

        firm varA varB varc      _merge
0  Accenture   A1  NaN  NaN   left_only
1       Citi   A2  NaN  NaN   left_only
2         GS   A3   B1   C1        both
3      Chase  NaN   B2   C2  right_only
4         WF  NaN   B3   C3  right_only

## tip 4: check your cdataset after the merge!
- len - is it what you expect? 
- value_count _merge - are you getting "enough" info from both?

In [31]:
new_df = left_df.merge(right_df,how='outer', validate='1:1', indicator=True)
print(len(new_df))

new_df['_merge'].value_counts()

5

_merge
left_only     2
right_only    2
both          1
Name: count, dtype: int64

## Part 2

- Q5: [Guess what category of join](https://ledatascifi.github.io/ledatascifi-2024/content/03/05b_merging.html#categories-of-joins) each of the following merges are?  
    1. `left_df` and `right_df` (you already know from Q4)
    1. `left_df` and `ChosenOne`
    1. `CurryForThree` and `left_df`
    1. `ChosenOne` and `CurryForThree`

- Q6: Do each of those four merge with `how='inner'` as an option. What is the length of each resulting dataframe?

In [32]:
left_df.merge(right_df,how='inner')

  firm varA varB varc
0   GS   A3   B1   C1

In [45]:
left_df.merge(ChosenOne.rename(columns={'tic':'firm'})
              ,how='inner')

  firm varA varB varc
0   GS   A3   B1   C1
1   GS   A3   B2   C2
2   GS   A3   B3   C3

In [47]:
CurryForThree.merge(left_df,
              how='inner',left_on='var1',right_on='firm')

  varD varE firm varA
0   D1   E1   GS   A3
1   D2   E2   GS   A3
2   D3   E3   GS   A3

In [48]:
ChosenOne.merge(CurryForThree,
              how='inner',left_on='tic',right_on='var1')

  tic varB varc varD varE
0  GS   B1   C1   D1   E1
1  GS   B1   C1   D2   E2
2  GS   B1   C1   D3   E3
3  GS   B2   C2   D1   E1
4  GS   B2   C2   D2   E2
5  GS   B2   C2   D3   E3
6  GS   B3   C3   D1   E1
7  GS   B3   C3   D2   E2
8  GS   B3   C3   D3   E3

- Q7: Do an outer merge of `left_df` and `ChosenOne`. How many observations are in the resulting data, and why is it different than we foudn in Q6?

- Q8: Merge these next two datasets with `how='inner'` as an option. What s the length of the resulting dataframe and do you think it's right?

In [ ]:
poppop = pd.DataFrame({
                    'tic': ['TSLA','TSLA','GM'],
                    'varB': ['2016', '2017', '2018'],
                    'varc': ['C1', 'C2', 'C3']})    

CurryForThree = pd.DataFrame({
                    'var1': ['F','TSLA','TSLA'],
                    'varD': ['2016', '2017', '2018'],
                    'varE': ['E1', 'E2', 'E3']}).set_index('var1')

## Part 3 - Collecting tips

You should, after class, collect tips about
- The most common use of merging and safeguards you can use
- When should you create variables - before or after a merge?
- Best practices for merging